Max-Hsu/Homework/G2-1/Embedded/1229/Measure - 複製/Philips/LPC29xx.h
/*****************************************************************************
 *   lpc29xx.h:  Master Header file for NXP LPC29xx Family Microprocessors
 *
 *   Copyright(C) 2007, NXP Semiconductor
 *   All rights reserved.
 *
 *   History
 *   2007.09  	ver 1.00    Prelimnary version, first Release
 *   2009.04	ver 2.00   LPC2900 codebundle release
 *
******************************************************************************/
#ifndef __LPC29XX_H
#define __LPC29XX_H

#define NOP __asm{ NOP }

/* Embedded flash memory controller */
#define   FMC_BASE_ADDR      0x20200000
#define   FCTR               (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x000))
#define   FS_LOADREQ         (1 << 15)
#define   FS_CACHECLR        (1 << 14)
#define   FS_CACHEBYP        (1 << 13)
#define   FS_PROGREQ         (1 << 12)
#define   FS_RLS             (1 << 11)
#define   FS_PDL             (1 << 10)
#define   FS_PD              (1 <<  9)
#define   FS_WPB             (1 <<  7)
#define   FS_ISS             (1 <<  6)
#define   FS_RLD             (1 <<  5)
#define   FS_DCR             (1 <<  4)
#define   FS_WEB             (1 <<  2)
#define   FS_WRE             (1 <<  1)
#define   FS_CS              (1 <<  0)
#define   FPTR               (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x008))
#define   FTCTR              (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x00C))
#define   FBWST              (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x010))
#define   CACHE2EN           0x8000
#define   SPECALWAYS         0x4000
#define   WST4               4
#define   FCRA               (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x01C))
#define   FMSSTART           (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x020))
#define   FMSSTOP            (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x024))

#define   MISR_START         (1 << 17)

#define FMS16                (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x028))

#define FMSW0                (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x02C))
#define FMSW1                (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x030))
#define FMSW2                (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x034))
#define FMSW3                (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x038))
// EEPROM registers
#define EECMD                (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x080))
#define EEADDR               (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x084))
#define EEWDATA              (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x088))
#define EERDATA              (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x08C))
#define EEWSTATE             (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x090))
#define EECLKDIV             (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x094))
#define EEPWRDWN             (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x098))
#define EESSTART             (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x09C))
#define EEMSSTOP             (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x0A0))
#define EEMSSIG              (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x0A4))
#define POS_DCM_COUNT        (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x0A8))
#define NEG_DCM_COUNT        (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x0AC))
#define EEDEV1STATUS4        (*(volatile unsigned long *)(FMC_BASE_ADDR + 0x0B0))
// Registers shared by Flash and EEPROM
#define FMC_INT_CLR_ENABLE   (*(volatile unsigned long *)(FMC_BASE_ADDR + 0xFD8))
#define FMC_INT_SET_ENABLE   (*(volatile unsigned long *)(FMC_BASE_ADDR + 0xFDC))
#define FMC_INT_STATUS       (*(volatile unsigned long *)(FMC_BASE_ADDR + 0xFE0))
#define FMC_INT_ENABLE       (*(volatile unsigned long *)(FMC_BASE_ADDR + 0xFE4))
#define FMC_INT_CLR_STATUS   (*(volatile unsigned long *)(FMC_BASE_ADDR + 0xFE8))
#define FMC_INT_SET_STATUS   (*(volatile unsigned long *)(FMC_BASE_ADDR + 0xFEC))


#define FMC_BASE_ADDR1        0x20000000

#define FMC_INX_SECTOR        (*(volatile unsigned long *)(FMC_BASE_ADDR1))     // MS

#define FMC_INX_SECTOR_11     (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xCB0))
#define FMC_INX_SECTOR_12     (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xCC0))
#define FMC_INX_SECTOR_13     (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xCD0))
#define FMC_INX_SECTOR_14     (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xCE0))
#define FMC_INX_SECTOR_15     (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xCF0))
#define FMC_INX_SECTOR_16     (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xE00))
#define FMC_INX_SECTOR_17     (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xE10))
#define FMC_INX_SECTOR_18     (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xE20))

#define FMC_INX_SECTOR_0      (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xC00))
#define FMC_INX_SECTOR_1      (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xC10))
#define FMC_INX_SECTOR_2      (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xC20))
#define FMC_INX_SECTOR_3      (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xC30))
#define FMC_INX_SECTOR_4      (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xC40))
#define FMC_INX_SECTOR_5      (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xC50))
#define FMC_INX_SECTOR_6      (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xC60))
#define FMC_INX_SECTOR_7      (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xC70))
#define FMC_INX_SECTOR_8      (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xC80))
#define FMC_INX_SECTOR_9      (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xC90))
#define FMC_INX_SECTOR_10     (*(volatile unsigned long *)(FMC_BASE_ADDR1 + 0xCA0))


/* External static memory address */
#define ESMC_BASE_ADDR       0x40000000

/* External static memory controller */
#define SMC_BASE_ADDR        0x60000000
#define SMC_IDCYR0           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x000))
#define SMC_WST1R0           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x004))
#define SMC_WST2R0           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x008))
#define SMC_WSTOENR0         (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x00C))
#define SMC_WSTWENR0         (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x010))
#define SMC_CR0              (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x014))
#define SMC_SR0              (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x018))

#define SMC_IDCYR1           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x01C))
#define SMC_WST1R1           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x020))
#define SMC_WST2R1           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x024))
#define SMC_WSTOENR1         (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x028))
#define SMC_WSTWENR1         (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x02C))
#define SMC_CR1              (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x030))
#define SMC_SR1              (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x034))

#define SMC_IDCYR2           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x038))
#define SMC_WST1R2           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x03C))
#define SMC_WST2R2           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x040))
#define SMC_WSTOENR2         (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x044))
#define SMC_WSTWENR2         (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x048))
#define SMC_CR2              (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x04C))
#define SMC_SR2              (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x050))

#define SMC_IDCYR3           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x054))
#define SMC_WST1R3           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x058))
#define SMC_WST2R3           (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x05C))
#define SMC_WSTOENR3         (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x060))
#define SMC_WSTWENR3         (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x064))
#define SMC_CR3              (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x068))
#define SMC_SR3              (*(volatile unsigned long *)(SMC_BASE_ADDR + 0x06C))

