Max-Hsu/Homework/G2-1/Embedded/1229/Measure - 複製/Philips/LPC29xx.h
#define SFSP3_BASE           (SCU_BASE_ADDR + 0x300)
#define SFSP3_0              (*(volatile unsigned long *)(SFSP3_BASE + 0x00))
#define SFSP3_1              (*(volatile unsigned long *)(SFSP3_BASE + 0x04))
#define SFSP3_2              (*(volatile unsigned long *)(SFSP3_BASE + 0x08))
#define SFSP3_3              (*(volatile unsigned long *)(SFSP3_BASE + 0x0C))
#define SFSP3_4              (*(volatile unsigned long *)(SFSP3_BASE + 0x10))
#define SFSP3_5              (*(volatile unsigned long *)(SFSP3_BASE + 0x14))
#define SFSP3_6              (*(volatile unsigned long *)(SFSP3_BASE + 0x18))
#define SFSP3_7              (*(volatile unsigned long *)(SFSP3_BASE + 0x1C))
#define SFSP3_8              (*(volatile unsigned long *)(SFSP3_BASE + 0x20))
#define SFSP3_9              (*(volatile unsigned long *)(SFSP3_BASE + 0x24))
#define SFSP3_10             (*(volatile unsigned long *)(SFSP3_BASE + 0x28))
#define SFSP3_11             (*(volatile unsigned long *)(SFSP3_BASE + 0x2C))
#define SFSP3_12             (*(volatile unsigned long *)(SFSP3_BASE + 0x30))
#define SFSP3_13             (*(volatile unsigned long *)(SFSP3_BASE + 0x34))
#define SFSP3_14             (*(volatile unsigned long *)(SFSP3_BASE + 0x38))
#define SFSP3_15             (*(volatile unsigned long *)(SFSP3_BASE + 0x3C))
#define SFSP3_16             (*(volatile unsigned long *)(SFSP3_BASE + 0x40))
#define SFSP3_17             (*(volatile unsigned long *)(SFSP3_BASE + 0x44))
#define SFSP3_18             (*(volatile unsigned long *)(SFSP3_BASE + 0x48))
#define SFSP3_19             (*(volatile unsigned long *)(SFSP3_BASE + 0x4C))
#define SFSP3_20             (*(volatile unsigned long *)(SFSP3_BASE + 0x50))
#define SFSP3_21             (*(volatile unsigned long *)(SFSP3_BASE + 0x54))
#define SFSP3_22             (*(volatile unsigned long *)(SFSP3_BASE + 0x58))
#define SFSP3_23             (*(volatile unsigned long *)(SFSP3_BASE + 0x5C))
#define SFSP3_24             (*(volatile unsigned long *)(SFSP3_BASE + 0x60))
#define SFSP3_25             (*(volatile unsigned long *)(SFSP3_BASE + 0x64))
#define SFSP3_26             (*(volatile unsigned long *)(SFSP3_BASE + 0x68))
#define SFSP3_27             (*(volatile unsigned long *)(SFSP3_BASE + 0x6C))
#define SFSP3_28             (*(volatile unsigned long *)(SFSP3_BASE + 0x70))
#define SFSP3_29             (*(volatile unsigned long *)(SFSP3_BASE + 0x74))
#define SFSP3_30             (*(volatile unsigned long *)(SFSP3_BASE + 0x78))
#define SFSP3_31             (*(volatile unsigned long *)(SFSP3_BASE + 0x7C))

#define SFSP4_BASE           (SCU_BASE_ADDR + 0x400)
#define SFSP4_0              (*(volatile unsigned long *)(SFSP4_BASE + 0x00))
#define SFSP4_1              (*(volatile unsigned long *)(SFSP4_BASE + 0x04))
#define SFSP4_2              (*(volatile unsigned long *)(SFSP4_BASE + 0x08))
#define SFSP4_3              (*(volatile unsigned long *)(SFSP4_BASE + 0x0C))
#define SFSP4_4              (*(volatile unsigned long *)(SFSP4_BASE + 0x10))
#define SFSP4_5              (*(volatile unsigned long *)(SFSP4_BASE + 0x14))
#define SFSP4_6              (*(volatile unsigned long *)(SFSP4_BASE + 0x18))
#define SFSP4_7              (*(volatile unsigned long *)(SFSP4_BASE + 0x1C))
#define SFSP4_8              (*(volatile unsigned long *)(SFSP4_BASE + 0x20))
#define SFSP4_9              (*(volatile unsigned long *)(SFSP4_BASE + 0x24))
#define SFSP4_10             (*(volatile unsigned long *)(SFSP4_BASE + 0x28))
#define SFSP4_11             (*(volatile unsigned long *)(SFSP4_BASE + 0x2C))
#define SFSP4_12             (*(volatile unsigned long *)(SFSP4_BASE + 0x30))
#define SFSP4_13             (*(volatile unsigned long *)(SFSP4_BASE + 0x34))
#define SFSP4_14             (*(volatile unsigned long *)(SFSP4_BASE + 0x38))
#define SFSP4_15             (*(volatile unsigned long *)(SFSP4_BASE + 0x3C))
#define SFSP4_16             (*(volatile unsigned long *)(SFSP4_BASE + 0x40))
#define SFSP4_17             (*(volatile unsigned long *)(SFSP4_BASE + 0x44))
#define SFSP4_18             (*(volatile unsigned long *)(SFSP4_BASE + 0x48))
#define SFSP4_19             (*(volatile unsigned long *)(SFSP4_BASE + 0x4C))
#define SFSP4_20             (*(volatile unsigned long *)(SFSP4_BASE + 0x50))
#define SFSP4_21             (*(volatile unsigned long *)(SFSP4_BASE + 0x54))
#define SFSP4_22             (*(volatile unsigned long *)(SFSP4_BASE + 0x58))
#define SFSP4_23             (*(volatile unsigned long *)(SFSP4_BASE + 0x5C))
#define SFSP4_24             (*(volatile unsigned long *)(SFSP4_BASE + 0x60))
#define SFSP4_25             (*(volatile unsigned long *)(SFSP4_BASE + 0x64))
#define SFSP4_26             (*(volatile unsigned long *)(SFSP4_BASE + 0x68))
#define SFSP4_27             (*(volatile unsigned long *)(SFSP4_BASE + 0x6C))
#define SFSP4_28             (*(volatile unsigned long *)(SFSP4_BASE + 0x70))
#define SFSP4_29             (*(volatile unsigned long *)(SFSP4_BASE + 0x74))
#define SFSP4_30             (*(volatile unsigned long *)(SFSP4_BASE + 0x78))
#define SFSP4_31             (*(volatile unsigned long *)(SFSP4_BASE + 0x7C))

#define SFSP5_BASE           (SCU_BASE_ADDR + 0x500)
#define SFSP5_0              (*(volatile unsigned long *)(SFSP5_BASE + 0x00))
#define SFSP5_1              (*(volatile unsigned long *)(SFSP5_BASE + 0x04))
#define SFSP5_2              (*(volatile unsigned long *)(SFSP5_BASE + 0x08))
#define SFSP5_3              (*(volatile unsigned long *)(SFSP5_BASE + 0x0C))
#define SFSP5_4              (*(volatile unsigned long *)(SFSP5_BASE + 0x10))
#define SFSP5_5              (*(volatile unsigned long *)(SFSP5_BASE + 0x14))
#define SFSP5_6              (*(volatile unsigned long *)(SFSP5_BASE + 0x18))
#define SFSP5_7              (*(volatile unsigned long *)(SFSP5_BASE + 0x1C))
#define SFSP5_8              (*(volatile unsigned long *)(SFSP5_BASE + 0x20))
#define SFSP5_9              (*(volatile unsigned long *)(SFSP5_BASE + 0x24))
#define SFSP5_10             (*(volatile unsigned long *)(SFSP5_BASE + 0x28))
#define SFSP5_11             (*(volatile unsigned long *)(SFSP5_BASE + 0x2C))
#define SFSP5_12             (*(volatile unsigned long *)(SFSP5_BASE + 0x30))
#define SFSP5_13             (*(volatile unsigned long *)(SFSP5_BASE + 0x34))
#define SFSP5_14             (*(volatile unsigned long *)(SFSP5_BASE + 0x38))
#define SFSP5_15             (*(volatile unsigned long *)(SFSP5_BASE + 0x3C))
#define SFSP5_16             (*(volatile unsigned long *)(SFSP5_BASE + 0x40))
#define SFSP5_17             (*(volatile unsigned long *)(SFSP5_BASE + 0x44))
#define SFSP5_18             (*(volatile unsigned long *)(SFSP5_BASE + 0x48))
#define SFSP5_19             (*(volatile unsigned long *)(SFSP5_BASE + 0x4C))


#define SEC_BASE             (SCU_BASE_ADDR + 0x000)
#define SEC_DIS              (*(volatile unsigned long *)(SEC_BASE + 0xB00))
#define SEC_STA              (*(volatile unsigned long *)(SEC_BASE + 0xB04))

#define SSSM_BASE            (SCU_BASE_ADDR + 0x000)
#define SSMM_0               (*(volatile unsigned long *)(SSSM_BASE + 0xC00))
#define SSMM_1               (*(volatile unsigned long *)(SSSM_BASE + 0xC04))
#define SSMM_2               (*(volatile unsigned long *)(SSSM_BASE + 0xC08))
#define SSMM_3               (*(volatile unsigned long *)(SSSM_BASE + 0xC0C))

/* Event Router register base */
#define ER_BASE_ADDR         0xE0002000
#define ER_PEND              (*(volatile unsigned long *)(ER_BASE_ADDR + 0xC00))
#define ER_INT_CLR           (*(volatile unsigned long *)(ER_BASE_ADDR + 0xC20))
#define ER_INT_SET           (*(volatile unsigned long *)(ER_BASE_ADDR + 0xC40))
#define ER_MASK              (*(volatile unsigned long *)(ER_BASE_ADDR + 0xC60))
#define ER_MASK_CLR          (*(volatile unsigned long *)(ER_BASE_ADDR + 0xC80))
#define ER_MASK_SET          (*(volatile unsigned long *)(ER_BASE_ADDR + 0xCA0))
#define ER_APR               (*(volatile unsigned long *)(ER_BASE_ADDR + 0xCC0))
#define ER_ATR               (*(volatile unsigned long *)(ER_BASE_ADDR + 0xCE0))
#define ER_RSR               (*(volatile unsigned long *)(ER_BASE_ADDR + 0xD20))

/* Watchdog register base */
#define WDT_BASE_ADDR        0xE0040000
#define WDT_WTCR             (*(volatile unsigned long *)(WDT_BASE_ADDR + 0x000))
#define WDT_TC               (*(volatile unsigned long *)(WDT_BASE_ADDR + 0x004))
#define WDT_PR               (*(volatile unsigned long *)(WDT_BASE_ADDR + 0x008))
#define WDT_WD_KEY           (*(volatile unsigned long *)(WDT_BASE_ADDR + 0x038))
#define WDT_TIMEOUT          (*(volatile unsigned long *)(WDT_BASE_ADDR + 0x03C))
#define WDT_DEBUG            (*(volatile unsigned long *)(WDT_BASE_ADDR + 0x040))
#define WDT_INT_CLR_ENABLE   (*(volatile unsigned long *)(WDT_BASE_ADDR + 0xFD8))
#define WDT_INT_SET_ENABLE   (*(volatile unsigned long *)(WDT_BASE_ADDR + 0xFDC))
#define WDT_INT_STATUS       (*(volatile unsigned long *)(WDT_BASE_ADDR + 0xFE0))
#define WDT_INT_ENABLE       (*(volatile unsigned long *)(WDT_BASE_ADDR + 0xFE4))
#define WDT_INT_CLR_STATUS   (*(volatile unsigned long *)(WDT_BASE_ADDR + 0xFE8))
#define WDT_INT_SET_STATUS   (*(volatile unsigned long *)(WDT_BASE_ADDR + 0xFEC))

/* Timer related reqiesters */
#define TMR0_BASE_ADDR       0xE0041000
#define TIM0_TCR             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x000))
#define TIM0_TC              (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x004))
#define TIM0_PR              (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x008))
#define TIM0_MCR             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x00C))
#define TIM0_EMR             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x010))
#define TIM0_MR0             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x014))
#define TIM0_MR1             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x018))
#define TIM0_MR2             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x01C))
#define TIM0_MR3             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x020))
#define TIM0_CCR             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x024))
#define TIM0_CR0             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x028))
#define TIM0_CR1             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x02C))
#define TIM0_CR2             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x030))
#define TIM0_CR3             (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x034))
#define TIM0_INT_CLR_ENABLE  (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0xFD8))
#define TIM0_INT_SET_ENABLE  (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0xFDC))
#define TIM0_INT_STATUS      (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0xFE0))
#define TIM0_INT_ENABLE      (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0xFE4))
#define TIM0_INT_CLR_STATUS  (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0xFE8))
#define TIM0_INT_SET_STATUS  (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0xFEC))

#define TMR1_BASE_ADDR       0xE0042000
#define TIM1_TCR             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x000))
#define TIM1_TC              (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x004))
#define TIM1_PR              (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x008))
#define TIM1_MCR             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x00C))
#define TIM1_EMR             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x010))
#define TIM1_MR0             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x014))
#define TIM1_MR1             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x018))
#define TIM1_MR2             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x01C))
#define TIM1_MR3             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x020))
#define TIM1_CCR             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x024))
#define TIM1_CR0             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x028))
#define TIM1_CR1             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x02C))
#define TIM1_CR2             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x030))
#define TIM1_CR3             (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x034))
#define TIM1_INT_CLR_ENABLE  (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0xFD8))
#define TIM1_INT_SET_ENABLE  (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0xFDC))
#define TIM1_INT_STATUS      (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0xFE0))
#define TIM1_INT_ENABLE      (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0xFE4))
#define TIM1_INT_CLR_STATUS  (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0xFE8))
#define TIM1_INT_SET_STATUS  (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0xFEC))

