Max-Hsu/Homework/G2-1/Embedded/1229/Measure - 複製/Philips/LPC29xx.h
#define GPIO1_BASE_ADDR      0xE004B000
#define GPIO1_PINS           (*(volatile unsigned long *)(GPIO1_BASE_ADDR + 0x000))
#define GPIO1_OR             (*(volatile unsigned long *)(GPIO1_BASE_ADDR + 0x004))
#define GPIO1_DR             (*(volatile unsigned long *)(GPIO1_BASE_ADDR + 0x008))

#define GPIO2_BASE_ADDR      0xE004C000
#define GPIO2_PINS           (*(volatile unsigned long *)(GPIO2_BASE_ADDR + 0x000))
#define GPIO2_OR             (*(volatile unsigned long *)(GPIO2_BASE_ADDR + 0x004))
#define GPIO2_DR             (*(volatile unsigned long *)(GPIO2_BASE_ADDR + 0x008))

#define GPIO3_BASE_ADDR      0xE004D000
#define GPIO3_PINS           (*(volatile unsigned long *)(GPIO3_BASE_ADDR + 0x000))
#define GPIO3_OR             (*(volatile unsigned long *)(GPIO3_BASE_ADDR + 0x004))
#define GPIO3_DR             (*(volatile unsigned long *)(GPIO3_BASE_ADDR + 0x008))

#define GPIO4_BASE_ADDR      0xE004E000
#define GPIO4_PINS           (*(volatile unsigned long *)(GPIO4_BASE_ADDR + 0x000))
#define GPIO4_OR             (*(volatile unsigned long *)(GPIO4_BASE_ADDR + 0x004))
#define GPIO4_DR             (*(volatile unsigned long *)(GPIO4_BASE_ADDR + 0x008))

#define GPIO5_BASE_ADDR      0xE004F000
#define GPIO5_PINS           (*(volatile unsigned long *)(GPIO5_BASE_ADDR + 0x000))
#define GPIO5_OR             (*(volatile unsigned long *)(GPIO5_BASE_ADDR + 0x004))
#define GPIO5_DR             (*(volatile unsigned long *)(GPIO5_BASE_ADDR + 0x008))

/* CAN related registers */
#define CAN0_BASE_ADDR       0xE0080000
#define CAN0MOD              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x00))
#define CAN0CMR              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x04))
#define CAN0GSR              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x08))
#define CAN0ICR              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x0C))
#define CAN0IER              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x10))
#define CAN0BTR              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x14))
#define CAN0EWL              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x18))
#define CAN0SR               (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x1C))
#define CAN0RFS              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x20))
#define CAN0RID              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x24))
#define CAN0RDA              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x28))
#define CAN0RDB              (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x2C))

#define CAN0TFI1             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x30))
#define CAN0TID1             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x34))
#define CAN0TDA1             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x38))
#define CAN0TDB1             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x3C))
#define CAN0TFI2             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x40))
#define CAN0TID2             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x44))
#define CAN0TDA2             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x48))
#define CAN0TDB2             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x4C))
#define CAN0TFI3             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x50))
#define CAN0TID3             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x54))
#define CAN0TDA3             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x58))
#define CAN0TDB3             (*(volatile unsigned long *)(CAN0_BASE_ADDR + 0x5C))

#define CAN1_BASE_ADDR       0xE0081000
#define CAN1MOD              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x00))
#define CAN1CMR              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x04))
#define CAN1GSR              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x08))
#define CAN1ICR              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x0C))
#define CAN1IER              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x10))
#define CAN1BTR              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x14))
#define CAN1EWL              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x18))
#define CAN1SR               (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x1C))
#define CAN1RFS              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x20))
#define CAN1RID              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x24))
#define CAN1RDA              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x28))
#define CAN1RDB              (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x2C))

#define CAN1TFI1             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x30))
#define CAN1TID1             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x34))
#define CAN1TDA1             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x38))
#define CAN1TDB1             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x3C))
#define CAN1TFI2             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x40))
#define CAN1TID2             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x44))
#define CAN1TDA2             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x48))
#define CAN1TDB2             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x4C))
#define CAN1TFI3             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x50))
#define CAN1TID3             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x54))
#define CAN1TDA3             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x58))
#define CAN1TDB3             (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x5C))

#define CAN_AFR_BASE_ADDR    0xE0086000

/* CAN CONTROLLERS AND ACCEPTANCE FILTER */
#define CAN_ACCEPT_BASE_ADDR   0xE0087000
#define CAN_AFMR               (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x00))
#define CAN_SFF_SA             (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x04))
#define CAN_SFF_GRP_SA         (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x08))
#define CAN_EFF_SA             (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x0C))
#define CAN_EFF_GRP_SA         (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x10))
#define CAN_EOT                (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x14))
#define CAN_LUT_ERR_ADR        (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x18))
#define CAN_LUT_ERR            (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x1C))

#define CAN_CENTRAL_BASE_ADDR  0xE0088000 
#define CAN_TX_SR              (*(volatile unsigned long *)(CAN_CENTRAL_BASE_ADDR + 0x00))
#define CAN_RX_SR              (*(volatile unsigned long *)(CAN_CENTRAL_BASE_ADDR + 0x04))
#define CAN_MSR                (*(volatile unsigned long *)(CAN_CENTRAL_BASE_ADDR + 0x08))

/* LIN controller register base */
#define LIN0_BASE_ADDR         0xE0089000
#define LIN0_LMODE             (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x00))
#define LIN0_LCFG              (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x04))
#define LIN0_LCMD              (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x08))
#define LIN0_LFBRG             (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x0C))
#define LIN0_LSTAT             (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x10))
#define LIN0_LIC               (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x14))
#define LIN0_LIE               (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x18))
#define LIN0_LCS               (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x20))
#define LIN0_LTO               (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x24))
#define LIN0_LID               (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x28))
#define LIN0_LDATA             (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x2C))
#define LIN0_LDATB             (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x30))
#define LIN0_LDATC             (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x34))
#define LIN0_LDATD             (*(volatile unsigned long *)(LIN0_BASE_ADDR + 0x38))

// LIN0 as UART
#define LUART0_BASE_ADDR       0xE0089000
#define LUART0_LMODE           (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x00))
#define LUART0_LCFG            (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x04))
#define LUART0_LCMD            (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x08))
#define LUART0_LFBRG           (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x0C))
#define LUART0_DATA            (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x10))
#define LUART0_IER             (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x14))
#define LUART0_IIR             (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x18))
#define LUART0_FCR             (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x18))
#define LUART0_LCR             (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x1C))
#define LUART0_SCR             (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x2C))
#define LUART0_ACR             (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x30))
#define LUART0_FDR             (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x38))
#define LUART0_TER             (*(volatile unsigned long *)(LUART0_BASE_ADDR + 0x40))

#define LIN1_BASE_ADDR         0xE008A000
#define LIN1_LMODE             (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x00))
#define LIN1_LCFG              (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x04))
#define LIN1_LCMD              (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x08))
#define LIN1_LFBRG             (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x0C))
#define LIN1_LSTAT             (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x10))
#define LIN1_LIC               (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x14))
#define LIN1_LIE               (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x18))
#define LIN1_LCS               (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x20))
#define LIN1_LTO               (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x24))
#define LIN1_LID               (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x28))
#define LIN1_LDATA             (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x2C))
#define LIN1_LDATB             (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x30))
#define LIN1_LDATC             (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x34))
#define LIN1_LDATD             (*(volatile unsigned long *)(LIN1_BASE_ADDR + 0x38))

// LIN1 as UART
#define LUART1_BASE_ADDR       0xE008A000
#define LUART1_LMODE           (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x00))
#define LUART1_LCFG            (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x04))
#define LUART1_LCMD            (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x08))
#define LUART1_LFBRG           (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x0C))
#define LUART1_DATA            (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x10))
#define LUART1_IER             (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x14))
#define LUART1_IIR             (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x18))
#define LUART1_FCR             (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x18))
#define LUART1_LCR             (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x1C))
#define LUART1_SCR             (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x2C))
#define LUART1_ACR             (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x30))
#define LUART1_FDR             (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x38))
#define LUART1_TER             (*(volatile unsigned long *)(LUART1_BASE_ADDR + 0x40))

/* Modulation and Sampling Control Subsystem(MSCSS) Timer related reqiesters */
#define MTMR0_BASE_ADDR        0xE00C0000
#define MTIM0_TCR              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x000))
#define MTIM0_TC               (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x004))
#define MTIM0_PR               (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x008))
#define MTIM0_MCR              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x00C))
#define MTIM0_EMR              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x010))
#define MTIM0_MR0              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x014))
#define MTIM0_MR1              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x018))
#define MTIM0_MR2              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x01C))
#define MTIM0_MR3              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x020))
#define MTIM0_CCR              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x024))
#define MTIM0_CR0              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x028))
#define MTIM0_CR1              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x02C))
#define MTIM0_CR2              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x030))
#define MTIM0_CR3              (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0x034))
#define MTIM0_INT_CLR_ENABLE   (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0xFD8))
#define MTIM0_INT_SET_ENABLE   (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0xFDC))
#define MTIM0_INT_STATUS       (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0xFE0))
#define MTIM0_INT_ENABLE       (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0xFE4))
#define MTIM0_INT_CLR_STATUS   (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0xFE8))
#define MTIM0_INT_SET_STATUS   (*(volatile unsigned long *)(MTMR0_BASE_ADDR + 0xFEC))

#define MTMR1_BASE_ADDR        0xE00C1000
#define MTIM1_TCR              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x000))
#define MTIM1_TC               (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x004))
#define MTIM1_PR               (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x008))
#define MTIM1_MCR              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x00C))
#define MTIM1_EMR              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x010))
#define MTIM1_MR0              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x014))
#define MTIM1_MR1              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x018))
#define MTIM1_MR2              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x01C))
#define MTIM1_MR3              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x020))
#define MTIM1_CCR              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x024))
#define MTIM1_CR0              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x028))
#define MTIM1_CR1              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x02C))
#define MTIM1_CR2              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x030))
#define MTIM1_CR3              (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0x034))
#define MTIM1_INT_CLR_ENABLE   (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0xFD8))
#define MTIM1_INT_SET_ENABLE   (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0xFDC))
#define MTIM1_INT_STATUS       (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0xFE0))
#define MTIM1_INT_ENABLE       (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0xFE4))
#define MTIM1_INT_CLR_STATUS   (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0xFE8))
#define MTIM1_INT_SET_STATUS   (*(volatile unsigned long *)(MTMR1_BASE_ADDR + 0xFEC))

//  ADC0( 5V) added in gallardo rev2
#define ADC0_BASE_ADDR         0xE00C2000
#define ADC0_ACC0              (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x000))
#define ADC0_ACC1              (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x004))
#define ADC0_ACC2              (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x008))
#define ADC0_ACC3              (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x00C))
#define ADC0_ACC4              (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x010))
#define ADC0_ACC5              (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x014))
#define ADC0_ACC6              (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x018))
#define ADC0_ACC7              (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x01C))
#define ADC0_ACC8              (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x020))
#define ADC0_ACC9              (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x024))
#define ADC0_ACC10             (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x028))
#define ADC0_ACC11             (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x02C))
#define ADC0_ACC12             (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x030))
#define ADC0_ACC13             (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x034))
#define ADC0_ACC14             (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x038))
#define ADC0_ACC15             (*(volatile unsigned long *)(ADC0_BASE_ADDR + 0x03C))

