Max-Hsu/Homework/G2-1/Embedded/1229/Measure - 複製/Philips/LPC29xx.h
#define PWM1_INTC_CLR_ENABLE (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0xFC0))
#define PWM1_INTC_SET_ENABLE (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0xFC4))
#define PWM1_INTC_STATUS     (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0xFC8))
#define PWM1_INTC_ENABLE     (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0xFCC))
#define PWM1_INTC_CLR_STATUS (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0xFD0))
#define PWM1_INTC_SET_STATUS (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0xFD4))

#define PWM2_BASE_ADDR       0xE00C7000
#define PWM2_MODECTL         (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x000))
#define PWM2_TRPCTL          (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x004))
#define PWM2_CAPCTL          (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x008))
#define PWM2_CAPTSRC         (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x00C))
#define PWM2_CTRL            (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x010))
#define PWM2_PRD             (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x014))
#define PWM2_PRSC            (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x018))
#define PWM2_SYNDEL          (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x01C))
#define PWM2_CNT             (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x020))
#define PWM2_MATCHA0         (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x100))
#define PWM2_MATCHA1         (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x104))
#define PWM2_MATCHA2         (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x108))
#define PWM2_MATCHA3         (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x10C))
#define PWM2_MATCHA4         (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x110))
#define PWM2_MATCHA5         (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x114))
#define PWM2_MATCHDA0        (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x200))
#define PWM2_MATCHDA1        (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x204))
#define PWM2_MATCHDA2        (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x208))
#define PWM2_MATCHDA3        (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x20C))
#define PWM2_MATCHDA4        (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x210))
#define PWM2_MATCHDA5        (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x214))
#define PWM2_CAPT0           (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x300))
#define PWM2_CAPT1           (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x304))
#define PWM2_CAPT2           (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x308))
#define PWM2_CAPT3           (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x30C))

#define PWM2_MODECTLS        (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x800))
#define PWM2_TRPCTLS         (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x804))
#define PWM2_CAPTCTLS        (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x808))
#define PWM2_CAPTSRCS        (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x80C))
#define PWM2_CTRLS           (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x810))
#define PWM2_PRDS            (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x814))
#define PWM2_PRSCS           (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x818))
#define PWM2_SYNDELS         (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x81C))
#define PWM2_MATCHACTS0      (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x900))
#define PWM2_MATCHACTS1      (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x904))
#define PWM2_MATCHACTS2      (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x908))
#define PWM2_MATCHACTS3      (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x90C))
#define PWM2_MATCHACTS4      (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x910))
#define PWM2_MATCHACTS5      (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0x914))
#define PWM2_MATCHDACTS0     (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xA00))
#define PWM2_MATCHDACTS1     (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xA04))
#define PWM2_MATCHDACTS2     (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xA08))
#define PWM2_MATCHDACTS3     (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xA0C))
#define PWM2_MATCHDACTS4     (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xA10))
#define PWM2_MATCHDACTS5     (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xA14))

#define PWM2_INT_CLR_ENABLE  (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xF90))
#define PWM2_INT_SET_ENABLE  (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xF94))
#define PWM2_INT_STATUS      (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xF98))
#define PWM2_INT_ENABLE      (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xF9C))
#define PWM2_INT_CLR_STATUS  (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFA0))
#define PWM2_INT_SET_STATUS  (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFA4))

#define PWM2_INTM_CLR_ENABLE (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFA8))
#define PWM2_INTM_SET_ENABLE (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFAC))
#define PWM2_INTM_STATUS     (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFB0))
#define PWM2_INTM_ENABLE     (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFB4))
#define PWM2_INTM_CLR_STATUS (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFB8))
#define PWM2_INTM_SET_STATUS (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFBC))

#define PWM2_INTC_CLR_ENABLE (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFC0))
#define PWM2_INTC_SET_ENABLE (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFC4))
#define PWM2_INTC_STATUS     (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFC8))
#define PWM2_INTC_ENABLE     (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFCC))
#define PWM2_INTC_CLR_STATUS (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFD0))
#define PWM2_INTC_SET_STATUS (*(volatile unsigned long *)(PWM2_BASE_ADDR + 0xFD4))

#define PWM3_BASE_ADDR       0xE00C8000
#define PWM3_MODECTL         (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x000))
#define PWM3_TRPCTL          (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x004))
#define PWM3_CAPCTL          (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x008))
#define PWM3_CAPTSRC         (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x00C))
#define PWM3_CTRL            (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x010))
#define PWM3_PRD             (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x014))
#define PWM3_PRSC            (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x018))
#define PWM3_SYNDEL          (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x01C))
#define PWM3_CNT             (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x020))
#define PWM3_MATCHA0         (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x100))
#define PWM3_MATCHA1         (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x104))
#define PWM3_MATCHA2         (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x108))
#define PWM3_MATCHA3         (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x10C))
#define PWM3_MATCHA4         (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x110))
#define PWM3_MATCHA5         (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x114))
#define PWM3_MATCHDA0        (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x200))
#define PWM3_MATCHDA1        (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x204))
#define PWM3_MATCHDA2        (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x208))
#define PWM3_MATCHDA3        (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x20C))
#define PWM3_MATCHDA4        (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x210))
#define PWM3_MATCHDA5        (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x214))
#define PWM3_CAPT0           (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x300))
#define PWM3_CAPT1           (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x304))
#define PWM3_CAPT2           (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x308))
#define PWM3_CAPT3           (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x30C))

#define PWM3_MODECTLS        (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x800))
#define PWM3_TRPCTLS         (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x804))
#define PWM3_CAPTCTLS        (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x808))
#define PWM3_CAPTSRCS        (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x80C))
#define PWM3_CTRLS           (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x810))
#define PWM3_PRDS            (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x814))
#define PWM3_PRSCS           (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x818))
#define PWM3_SYNDELS         (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x81C))
#define PWM3_MATCHACTS0      (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x900))
#define PWM3_MATCHACTS1      (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x904))
#define PWM3_MATCHACTS2      (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x908))
#define PWM3_MATCHACTS3      (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x90C))
#define PWM3_MATCHACTS4      (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x910))
#define PWM3_MATCHACTS5      (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0x914))
#define PWM3_MATCHDACTS0     (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xA00))
#define PWM3_MATCHDACTS1     (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xA04))
#define PWM3_MATCHDACTS2     (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xA08))
#define PWM3_MATCHDACTS3     (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xA0C))
#define PWM3_MATCHDACTS4     (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xA10))
#define PWM3_MATCHDACTS5     (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xA14))

#define PWM3_INT_CLR_ENABLE  (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xF90))
#define PWM3_INT_SET_ENABLE  (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xF94))
#define PWM3_INT_STATUS      (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xF98))
#define PWM3_INT_ENABLE      (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xF9C))
#define PWM3_INT_CLR_STATUS  (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFA0))
#define PWM3_INT_SET_STATUS  (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFA4))

#define PWM3_INTM_CLR_ENABLE (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFA8))
#define PWM3_INTM_SET_ENABLE (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFAC))
#define PWM3_INTM_STATUS     (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFB0))
#define PWM3_INTM_ENABLE     (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFB4))
#define PWM3_INTM_CLR_STATUS (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFB8))
#define PWM3_INTM_SET_STATUS (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFBC))

