Max-Hsu/Homework/G2-1/Embedded/1229/Measure - 複製/Philips/LPC29xx.h
#define PWM3_INTC_CLR_ENABLE (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFC0))
#define PWM3_INTC_SET_ENABLE (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFC4))
#define PWM3_INTC_STATUS     (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFC8))
#define PWM3_INTC_ENABLE     (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFCC))
#define PWM3_INTC_CLR_STATUS (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFD0))
#define PWM3_INTC_SET_STATUS (*(volatile unsigned long *)(PWM3_BASE_ADDR + 0xFD4))

/* Clock configuration Unit register base addr. */
#define CGU_BASE_ADDR        0xFFFF8000
#define CGU_FREQ_MON         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x14))
#define CGU_RDET             (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x18))

#define   LPOSC_PRESENT      (1<<0)
#define   XTAL_PRESENT       (1<<1)
#define   PLL_PRESENT        (1<<2)
#define   PLL120_PRESENT     (1<<3)
#define   PLL240_PRESENT     (1<<4)
#define   FDIV0_PRESENT      (1<<5)
#define   FDIV1_PRESENT      (1<<6)
#define   FDIV2_PRESENT      (1<<7)
#define   FDIV3_PRESENT      (1<<8)
#define   FDIV4_PRESENT      (1<<9)
#define   FDIV5_PRESENT      (1<<10)
#define   FDIV6_PRESENT      (1<<11)

#define CGU_OSC_STAT         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x1C))
#define CGU_OSC_CTRL         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x20))
#define CGU_PLL_STAT         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x24))
#define   PLL_LOCK           1
#define CGU_PLL_CTRL         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x28))
#define   PLL_XTAL_SEL       0x01000000
#define   MSEL_SHIFT         16
#define   P23EN              4
#define   PLL_PD             1
#define CGU_FDIV_STAT0       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x2C))
#define CGU_FDIV_CONF0       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x30))
#define CGU_FDIV_STAT1       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x34))
#define CGU_FDIV_CONF1       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x38))
#define CGU_FDIV_STAT2       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x3C))
#define CGU_FDIV_CONF2       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x40))
#define CGU_FDIV_STAT3       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x44))
#define CGU_FDIV_CONF3       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x48))
#define CGU_FDIV_STAT4       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x4C))
#define CGU_FDIV_CONF4       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x50))
#define CGU_FDIV_STAT5       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x54))
#define CGU_FDIV_CONF5       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x58))
#define CGU_FDIV_STAT6       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x5C))
#define CGU_FDIV_CONF6       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x60))

#define SAFE_CLK_STAT        (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x64))
#define SAFE_CLK_CONF        (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x68))
#define SYS_CLK_STAT         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x6C))
#define SYS_CLK_CONF         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x70))
#define   CLK_SEL_XTAL       0x01000000
#define   CLK_SEL_PLL        0x02000000
#define   CLK_SEL_PLL_120    0x03000000
#define   CLK_SEL_PLL_240    0x04000000
#define   CLK_SEL_PLL_FDIV0  0x05000000
#define   CLK_SEL_PLL_FDIV1  0x06000000
#define   CLK_SEL_PLL_FDIV2  0x07000000
#define   CLK_SEL_PLL_FDIV3  0x08000000
#define   CLK_SEL_PLL_FDIV4  0x09000000
#define   CLK_SEL_PLL_FDIV5  0x0A000000
#define   CLK_SEL_PLL_FDIV6  0x0B000000
#define   AUTOBLK            0x800
#define   DIV8               0x1C
#define   DIV7               0x18
#define   DIV6               0x14
#define   DIV5               0x10
#define   DIV4               0xC
#define   DIV3               0x8
#define   DIV2               0x4
#define   DIV1               0x0
#define PCR_CLK_STAT         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x74))
#define PCR_CLK_CONF         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x78))
#define IVNSS_CLK_STAT       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x7C))
#define IVNSS_CLK_CONF       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x80))
#define MSCSS_CLK_STAT       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x84))
#define MSCSS_CLK_CONF       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x88))

#define ICLK0_CLK_STAT       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x8C))
#define ICLK0_CLK_CONF       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x90))
#define UART_CLK_STAT        (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x94))
#define UART_CLK_CONF        (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x98))
#define SPI_CLK_STAT         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0x9C))
#define SPI_CLK_CONF         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xA0))
#define TMR_CLK_STAT         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xA4))
#define TMR_CLK_CONF         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xA8))
#define ADC_CLK_STAT         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xAC))
#define ADC_CLK_CONF         (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xB0))
#define CTEST_CLK_STAT       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xB4))
#define CTEST_CLK_CONF       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xB8))
#define ICLK1_CLK_STAT       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xBC))
#define ICLK1_CLK_CONF       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xC0))

#define CGU_INT_CLR_ENABLE   (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xFD8))
#define CGU_INT_SET_ENABLE   (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xFDC))
#define CGU_INT_STATUS       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xFE0))
#define CGU_INT_ENABLE       (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xFE4))
#define CGU_INT_CLR_STATUS   (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xFE8))
#define CGU_INT_SET_STATUS   (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xFEC))
#define CGU_BUS_DISABLE      (*(volatile unsigned long *)(CGU_BASE_ADDR + 0xFF4))

// CGU1 HAS BEEN ADDED  TO GENERATE CLOCKS FOR THE USB
/* Clock configuration Unit 1 register base addr. */
#define CGU1_BASE_ADDR       0xFFFFB000
#define CGU1_FREQ_MON        (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x14))
#define CGU1_RDET            (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x18))
#define CGU1_PLL_STAT        (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x1C))
#define CGU1_PLL_CTRL        (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x20))
#define CGU1_FDIV_STAT0      (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x24))
#define CGU1_FDIV_CONF0      (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x28))
#define USB_CLK_STAT         (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x2C))
#define USB_CLK_CONF         (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x30))
#define USB_I2C_CLK_STAT     (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x34))
#define USB_I2C_CLK_CONF     (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x38))
#define OUT_CLK_STAT         (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x3C))
#define OUT_CLK_CONF         (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0x40))
#define   CLK_SEL_ICLK0       0x00000000
#define   CLK_SEL_ICLK1       0x01000000
#define CGU1_INT_CLR_ENABLE   (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0xFD8))
#define CGU1_INT_SET_ENABLE   (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0xFDC))
#define CGU1_INT_STATUS       (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0xFE0))
#define CGU1_INT_ENABLE       (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0xFE4))
#define CGU1_INT_CLR_STATUS   (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0xFE8))
#define CGU1_INT_SET_STATUS   (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0xFEC))
#define CGU1_BUS_DISABLE      (*(volatile unsigned long *)(CGU1_BASE_ADDR + 0xFF4))

/* Reset Generation Unit register base addr. */
#define RGU_BASE_ADDR        0xFFFF9000
#define RGU_RESET_CTRL0      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x100))
#define RGU_RESET_CTRL1      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x104))
#define RGU_RESET_STAT0      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x110))
#define RGU_RESET_STAT1      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x114))
#define RGU_RESET_STAT2      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x118))
#define RGU_RESET_STAT3      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x11C))

#define RGU_RST_ACTIVE_STAT0 (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x150))
#define RGU_RST_ACTIVE_STAT1 (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x154))
#define RGU_RST_SRC          (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x404))
#define RGU_PCR_RST_SRC      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x408))
#define RGU_COLD_RST_SRC     (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x40C))
#define RGU_WARM_RST_SRC     (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x410))

#define RGU_SCU_RST_SRC      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x480))
#define RGU_CFID_RST_SRC     (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x484))
#define RGU_FMC_RST_SRC      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x490))
#define RGU_EMC_RST_SRC      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x494))
#define RGU_SMC_SRC          (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x498))
#define RGU_GESS_A2V_RST_SRC (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4A0))
#define RGU_PESS_A2V_RST_SRC (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4A4))
#define RGU_GPIO_RST_SRC     (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4A8))
#define RGU_UART_RST_SRC     (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4AC))
#define RGU_TMR_RST_SRC      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4B0))
#define RGU_SPI_RST_SRC      (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4B4))

#define RGU_IVNSS_A2V_RST_SRC (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4B8))
#define RGU_IVNSS_CAN_RST_SRC (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4BC))
#define RGU_IVNSS_LIN_RST_SRC (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4C0))
#define RGU_MSCSS_A2V_RST_SRC (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4C4))
#define RGU_MSCSS_PWM_RST_SRC (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4C8))
#define RGU_MSCSS_ADC_RST_SRC (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4CC))
#define RGU_MSCSS_TMR_RST_SRC (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4D0))
#define RGU_VIC_RST_SRC       (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4F0))
#define RGU_AHB_RST_SRC       (*(volatile unsigned long *)(RGU_BASE_ADDR + 0x4F4))
#define RGU_BUS_DISABLE       (*(volatile unsigned long *)(RGU_BASE_ADDR + 0xFF4))

/* Power Management Unit register base addr. */
#define PMU_BASE_ADDR        0xFFFFA000
#define PMU_PM                (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x000))
#define PMU_BASE_STAT         (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x004))
#define PMU_CLK_CFG_SAFE      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x100))
#define PMU_CLK_STAT_SAFE     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x104))
#define PMU_CLK_CFG_CPU       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x200))
#define PMU_CLK_STAT_CPU      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x204))
#define PMU_CLK_CFG_SYS       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x208))
#define PMU_CLK_STAT_SYS      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x20C))
#define PMU_CLK_CFG_PCR       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x210))
#define PMU_CLK_STAT_PCR      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x214))

