Max-Hsu/Homework/G2-1/Embedded/1229/Measure - 複製/Philips/LPC29xx.h
#define PMU_CLK_CFG_FMC       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x218))
#define PMU_CLK_STAT_FMC      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x21C))
#define PMU_CLK_CFG_RAM0      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x220))
#define PMU_CLK_STAT_RAM0     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x224))
#define PMU_CLK_CFG_RAM1      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x228))
#define PMU_CLK_STAT_RAM1     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x22C))

#define PMU_CLK_CFG_SMC       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x230))
#define PMU_CLK_STAT_SMC      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x234))
#define PMU_CLK_CFG_GESS      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x238))
#define PMU_CLK_STAT_GESS     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x23C))
#define PMU_CLK_CFG_VIC       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x240))
#define PMU_CLK_STAT_VIC      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x244))
#define PMU_CLK_CFG_PESS      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x248))
#define PMU_CLK_STAT_PESS     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x24C))

#define PMU_CLK_CFG_GPIO0     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x250))
#define PMU_CLK_STAT_GPIO0    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x254))
#define PMU_CLK_CFG_GPIO1     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x258))
#define PMU_CLK_STAT_GPIO1    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x25C))
#define PMU_CLK_CFG_GPIO2     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x260))
#define PMU_CLK_STAT_GPIO2    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x264))
#define PMU_CLK_CFG_GPIO3     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x268))
#define PMU_CLK_STAT_GPIO3    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x26C))
#define PMU_CLK_CFG_IVNSSA    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x270))
#define PMU_CLK_STAT_IVNSSA   (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x274))
#define PMU_CLK_CFG_MSCSSA    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x278))
#define PMU_CLK_STAT_MSCSSA   (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x27C))

#define PMU_CLK_CFG_GPIO4     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x280))
#define PMU_CLK_STAT_GPIO4    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x284))
#define PMU_CLK_CFG_GPIO5     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x288))
#define PMU_CLK_STAT_GPIO5    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x28C))
#define PMU_CLK_CFG_DMA       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x290))
#define PMU_CLK_STAT_DMA      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x294))
#define PMU_CLK_CFG_USB       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x298))
#define PMU_CLK_STAT_USB      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x29C))

#define PMU_CLK_CFG_PCR_IP    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x300))
#define PMU_CLK_STAT_PCR_IP   (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x304))

#define PMU_CLK_CFG_IVNSS_VPB  (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x400))
#define PMU_CLK_STAT_IVNSS_VPB (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x404))
#define PMU_CLK_CFG_CANCA     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x408))
#define PMU_CLK_STAT_CANCA    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x40C))
#define PMU_CLK_CFG_CANC0     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x410))
#define PMU_CLK_STAT_CANC0    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x414))
#define PMU_CLK_CFG_CANC1     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x418))
#define PMU_CLK_STAT_CANC1    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x41C))

#define PMU_CLK_CFG_I2C0       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x420))
#define PMU_CLK_STAT_I2C0      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x424))
#define PMU_CLK_CFG_I2C1       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x428))
#define PMU_CLK_STAT_I2C1      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x42C))
//
#define PMU_CLK_CFG_LIN0      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x440))
#define PMU_CLK_STAT_LIN0     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x444))
#define PMU_CLK_CFG_LIN1      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x448))
#define PMU_CLK_STAT_LIN1     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x44C))

#define PMU_CLK_CFG_MSCSS_VPB  (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x500))
#define PMU_CLK_STAT_MSCSS_VPB (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x504))
#define PMU_CLK_CFG_MTMR0     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x508))
#define PMU_CLK_STAT_MTMR0    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x50C))
#define PMU_CLK_CFG_MTMR1     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x510))
#define PMU_CLK_STAT_MTMR1    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x514))
#define PMU_CLK_CFG_PWM0      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x518))
#define PMU_CLK_STAT_PWM0     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x51C))
#define PMU_CLK_CFG_PWM1      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x520))
#define PMU_CLK_STAT_PWM1     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x524))
#define PMU_CLK_CFG_PWM2      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x528))
#define PMU_CLK_STAT_PWM2     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x52C))
#define PMU_CLK_CFG_PWM3      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x530))
#define PMU_CLK_STAT_PWM3     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x534))

#define PMU_CLK_CFG_ADC0_VPB  (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x538))
#define PMU_CLK_STAT_ADC0_VPB (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x53C))

#define PMU_CLK_CFG_ADC1_VPB  (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x540))
#define PMU_CLK_STAT_ADC1_VPB (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x544))
#define PMU_CLK_CFG_ADC2_VPB  (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x548))
#define PMU_CLK_STAT_ADC2_VPB (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x54C))

#define PMU_CLK_CFG_QEI       (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x550))
#define PMU_CLK_STAT_QEI      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x554))

#define PMU_CLK_CFG_OUT_CLK   (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x600))
#define PMU_CLK_STAT_OUT_CLK  (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x604))

