Max-Hsu/Homework/G2-1/Embedded/1229/Measure - 複製/Philips/LPC29xx.h
#define PMU_CLK_CFG_UART0     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x700))
#define PMU_CLK_STAT_UART0    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x704))
#define PMU_CLK_CFG_UART1     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x708))
#define PMU_CLK_STAT_UART1    (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x70C))

#define PMU_CLK_CFG_SPI0      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x800))
#define PMU_CLK_STAT_SPI0     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x804))
#define PMU_CLK_CFG_SPI1      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x808))
#define PMU_CLK_STAT_SPI1     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x80C))
#define PMU_CLK_CFG_SPI2      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x810))
#define PMU_CLK_STAT_SPI2     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x814))

#define PMU_CLK_CFG_TMR0      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x900))
#define PMU_CLK_STAT_TMR0     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x904))
#define PMU_CLK_CFG_TMR1      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x908))
#define PMU_CLK_STAT_TMR1     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x90C))
#define PMU_CLK_CFG_TMR2      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x910))
#define PMU_CLK_STAT_TMR2     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x914))
#define PMU_CLK_CFG_TMR3      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x918))
#define PMU_CLK_STAT_TMR3     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0x91C))

#define PMU_CLK_CFG_ADC0      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xA00))
#define PMU_CLK_STAT_ADC0     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xA04))

#define PMU_CLK_CFG_ADC1      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xA08))
#define PMU_CLK_STAT_ADC1     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xA0C))
#define PMU_CLK_CFG_ADC2      (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xA10))
#define PMU_CLK_STAT_ADC2     (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xA14))

#define PMU_CLK_CFG_TSSHELL   (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xB00))
#define PMU_CLK_STAT_TSSHELL  (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xB04))

#define PMU_CLK_CFG_USB_I2C   (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xC00))
#define PMU_CLK_STAT_USB_I2C  (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xC04))

#define PMU_CLK_CFG_USB_CLK   (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xD00))
#define PMU_CLK_STAT_USB_CLK  (*(volatile unsigned long *)(PMU_BASE_ADDR + 0xD04))

/* General-purpose DMA Controller */
#define DMA_BASE_ADDR          0xE0140000
#define GPDMA_INT_STAT         (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x000))
#define GPDMA_INT_TCSTAT       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x004))
#define GPDMA_INT_TCCLR        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x008))
#define GPDMA_INT_ERR_STAT     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x00C))
#define GPDMA_INT_ERR_CLR      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x010))
#define GPDMA_RAW_INT_TCSTAT   (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x014))
#define GPDMA_RAW_INT_ERR_STAT (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x018))
#define GPDMA_ENABLED_CHNS     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x01C))
#define GPDMA_SOFT_BREQ        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x020))
#define GPDMA_SOFT_SREQ        (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x024))
#define GPDMA_SOFT_LBREQ       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x028))
#define GPDMA_SOFT_LSREQ       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x02C))
#define GPDMA_CONFIG           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x030))
#define GPDMA_SYNC             (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x034))

/* DMA channel 0 registers */
#define GPDMA_CH0_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x100))
#define GPDMA_CH0_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x104))
#define GPDMA_CH0_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x108))
#define GPDMA_CH0_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x10C))
#define GPDMA_CH0_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x110))

/* DMA channel 1 registers */
#define GPDMA_CH1_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x120))
#define GPDMA_CH1_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x124))
#define GPDMA_CH1_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x128))
#define GPDMA_CH1_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x12C))
#define GPDMA_CH1_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x130))

/* DMA channel 2 registers */
#define GPDMA_CH2_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x140))
#define GPDMA_CH2_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x144))
#define GPDMA_CH2_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x148))
#define GPDMA_CH2_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x14C))
#define GPDMA_CH2_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x150))

/* DMA channel 3 registers */
#define GPDMA_CH3_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x160))
#define GPDMA_CH3_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x164))
#define GPDMA_CH3_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x168))
#define GPDMA_CH3_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x16C))
#define GPDMA_CH3_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x170))

/* DMA channel 4 registers */
#define GPDMA_CH4_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x180))
#define GPDMA_CH4_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x184))
#define GPDMA_CH4_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x188))
#define GPDMA_CH4_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x18C))
#define GPDMA_CH4_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x190))

/* DMA channel 5 registers */
#define GPDMA_CH5_SRC      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1A0))
#define GPDMA_CH5_DEST     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1A4))
#define GPDMA_CH5_LLI      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1A8))
#define GPDMA_CH5_CTRL     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1AC))
#define GPDMA_CH5_CFG      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x1B0))

